cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Some core stuff
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'gettext'

# Perl, because yes
brew 'pcre'
brew 'perl'

# Git helpers
brew 'git'
brew 'git-flow'
cask 'fastlane'

# System Helpers
brew 'mtr'
brew 'nmap'
brew 'postgres-xc'

# Other Utilities
brew 'haproxy'
brew 'macvim'
cask 'kdiff3'
cask 'ngrok'
brew 'md5sha1sum'
brew 'fx'

# Shell utilities
brew 'the_silver_searcher'
brew 'thefuck'
brew 'zsh'
brew 'zsh-completions'
